aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_clock.c
/******************************************************************************
 ******************************* Clock Sources ********************************
 *****************************************************************************/
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_PATHMUX[] =
{
    &CYHAL_CLOCK_IMO,
#if SRSS_ECO_PRESENT
    &CYHAL_CLOCK_ECO,
#endif
    &CYHAL_CLOCK_EXT,
#if SRSS_ALTHF_PRESENT
    &CYHAL_CLOCK_ALTHF,
#endif
    &CYHAL_CLOCK_ILO,
#if SRSS_PILO_PRESENT
    &CYHAL_CLOCK_PILO,
#endif
#if SRSS_BACKUP_PRESENT
    &CYHAL_CLOCK_WCO,
#endif
#if SRSS_ALTLF_PRESENT
    &CYHAL_CLOCK_ALTLF,
#endif
};
#if SRSS_MFO_PRESENT
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_MFO[] =
{
    &CYHAL_CLOCK_IMO,
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_MF[] =
{
    &CYHAL_CLOCK_MFO,
};
#endif
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_SLOW[] =
{
    &CYHAL_CLOCK_PERI,
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_FAST[] =
{
    &CYHAL_CLOCK_HF[0],
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_TIMER[] =
{
    &CYHAL_CLOCK_IMO,
    &CYHAL_CLOCK_HF[0],
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_ALT_SYS_TICK[] =
{
    &CYHAL_CLOCK_IMO,
#if SRSS_ECO_PRESENT
    &CYHAL_CLOCK_ECO,
#endif
    &CYHAL_CLOCK_TIMER,
    &CYHAL_CLOCK_LF,
    &CYHAL_CLOCK_FAST,
    &CYHAL_CLOCK_SLOW,
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_BAK[] =
{
    &CYHAL_CLOCK_LF,
#if SRSS_BACKUP_PRESENT
    &CYHAL_CLOCK_WCO,
#endif
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_LF[] =
{
    &CYHAL_CLOCK_ILO,
#if SRSS_PILO_PRESENT
    &CYHAL_CLOCK_PILO,
#endif
#if SRSS_BACKUP_PRESENT
    &CYHAL_CLOCK_WCO,
#endif
#if SRSS_ALTLF_PRESENT
    &CYHAL_CLOCK_ALTLF,
#endif
};
const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_HF[] =
{
    &CYHAL_CLOCK_FLL,
#if (SRSS_NUM_PLL > 0)
    &CYHAL_CLOCK_PLL[0],
#endif
#if (SRSS_NUM_PLL > 1)
    &CYHAL_CLOCK_PLL[1],
#endif
#if (SRSS_NUM_PLL > 2)
    &CYHAL_CLOCK_PLL[2],
#endif
#if (SRSS_NUM_PLL > 3)
    &CYHAL_CLOCK_PLL[3],
#endif
#if (SRSS_NUM_PLL > 4)
    &CYHAL_CLOCK_PLL[4],
#endif
#if (SRSS_NUM_PLL > 5)
    &CYHAL_CLOCK_PLL[5],
#endif
#if (SRSS_NUM_PLL > 6)
    &CYHAL_CLOCK_PLL[6],
#endif
#if (SRSS_NUM_PLL > 7)
    &CYHAL_CLOCK_PLL[7],
#endif
#if (SRSS_NUM_PLL > 8)
    &CYHAL_CLOCK_PLL[8],
#endif
#if (SRSS_NUM_PLL > 9)
    &CYHAL_CLOCK_PLL[9],
#endif
#if (SRSS_NUM_PLL > 10)
    &CYHAL_CLOCK_PLL[10],
#endif
#if (SRSS_NUM_PLL > 11)
    &CYHAL_CLOCK_PLL[11],
#endif
#if (SRSS_NUM_PLL > 12)
    &CYHAL_CLOCK_PLL[12],
#endif
#if (SRSS_NUM_PLL > 13)
    &CYHAL_CLOCK_PLL[13],
#endif
#if (SRSS_NUM_PLL > 14)
    &CYHAL_CLOCK_PLL[14],
#endif
    &CYHAL_CLOCK_PATHMUX[0],
#if (SRSS_NUM_CLKPATH > 1)
    &CYHAL_CLOCK_PATHMUX[1],
#endif
#if (SRSS_NUM_CLKPATH > 2)
    &CYHAL_CLOCK_PATHMUX[2],
#endif
#if (SRSS_NUM_CLKPATH > 3)
    &CYHAL_CLOCK_PATHMUX[3],
#endif
#if (SRSS_NUM_CLKPATH > 4)
    &CYHAL_CLOCK_PATHMUX[4],
#endif
#if (SRSS_NUM_CLKPATH > 5)
    &CYHAL_CLOCK_PATHMUX[5],
#endif
#if (SRSS_NUM_CLKPATH > 6)
    &CYHAL_CLOCK_PATHMUX[6],
#endif
#if (SRSS_NUM_CLKPATH > 7)
    &CYHAL_CLOCK_PATHMUX[7],
#endif
#if (SRSS_NUM_CLKPATH > 8)
    &CYHAL_CLOCK_PATHMUX[8],
#endif
#if (SRSS_NUM_CLKPATH > 9)
    &CYHAL_CLOCK_PATHMUX[9],
#endif
#if (SRSS_NUM_CLKPATH > 10)
    &CYHAL_CLOCK_PATHMUX[10],
#endif
#if (SRSS_NUM_CLKPATH > 11)
    &CYHAL_CLOCK_PATHMUX[11],
#endif
#if (SRSS_NUM_CLKPATH > 12)
    &CYHAL_CLOCK_PATHMUX[12],
#endif
#if (SRSS_NUM_CLKPATH > 13)
    &CYHAL_CLOCK_PATHMUX[13],
#endif
#if (SRSS_NUM_CLKPATH > 14)
    &CYHAL_CLOCK_PATHMUX[14],
#endif
#if (SRSS_NUM_CLKPATH > 15)
    &CYHAL_CLOCK_PATHMUX[15],
#endif
};

/******************************************************************************
 ***************************** Support Functions*******************************
 *****************************************************************************/
static void setup_clock_inst(cyhal_clock_t *clock, const cyhal_resource_inst_t* resource, bool reserved)
{
    clock->div_type = (cy_en_divider_types_t)resource->block_num;
    clock->div_num = resource->channel_num;
    clock->block = (cyhal_clock_block_t)resource->block_num;
    clock->channel = resource->channel_num;
    clock->reserved = reserved;
}

static cy_rslt_t compute_div(uint32_t input_hz, uint32_t desired_hz, uint32_t divider_bits, const cyhal_clock_tolerance_t *tolerance, uint32_t *div)
{
    uint32_t mask = (1 << (divider_bits - 1)) - 1;
    // Compute the config value, which is generally 1 less than divider.
    // eg: Legal divider is 1-256, cfg value 0-255
    uint32_t div1 = (input_hz / desired_hz) & mask;        //Round up
    if (NULL == tolerance)
    {
        *div = div1;
        return CY_RSLT_SUCCESS;
    }
    else
    {
        uint32_t div2 = ((input_hz / desired_hz) - 1) & mask;  //Round down
        uint32_t diff;
        uint32_t diff1 = (uint32_t)abs(cyhal_utils_calculate_tolerance(tolerance->type, desired_hz, input_hz / ((uint32_t)div1 + 1)));
        uint32_t diff2 = (uint32_t)abs(cyhal_utils_calculate_tolerance(tolerance->type, desired_hz, input_hz / ((uint32_t)div2 + 1)));
        if (diff1 < diff2)
        {
            diff = diff1;
            *div = div1;
        }
        else
        {
            diff = diff2;
            *div = div2;
        }

        return (diff > tolerance->value)
            ? CYHAL_CLOCK_RSLT_ERR_FREQ
            : CY_RSLT_SUCCESS;
    }
}

static uint32_t get_lf_frequency(void)
{
    cy_en_clklf_in_sources_t source = Cy_SysClk_ClkLfGetSource();
    switch (source)
    {
        case CY_SYSCLK_CLKLF_IN_ILO:
            return CY_SYSCLK_ILO_FREQ;
#if SRSS_PILO_PRESENT
        case CY_SYSCLK_CLKLF_IN_PILO:
            return CY_SYSCLK_PILO_FREQ;
#endif
#if SRSS_BACKUP_PRESENT
        case CY_SYSCLK_CLKLF_IN_WCO:
            return CY_SYSCLK_WCO_FREQ;
#endif
#if SRSS_ALTLF_PRESENT
        case CY_SYSCLK_CLKLF_IN_ALTLF:
            return Cy_SysClk_AltLfGetFrequency();
#endif
        default:
            CY_ASSERT(false);
            return 0;
    }
}

static uint32_t get_channel_count(cyhal_clock_block_t block)
{
    switch (block)
    {
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
            return PERI_DIV_8_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return PERI_DIV_16_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
            return PERI_DIV_16_5_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return PERI_DIV_24_5_NR;
        case CYHAL_CLOCK_BLOCK_PATHMUX:
            return SRSS_NUM_CLKPATH;
        case CYHAL_CLOCK_BLOCK_PLL:
            return SRSS_NUM_PLL;
        case CYHAL_CLOCK_BLOCK_HF:
            return SRSS_NUM_HFROOT;
        default:
            return 1;
    }
}

